# üß† Subqueries, Common Table Expressions (CTEs), and Views

## üìä Subqueries Overview

A **subquery** is a query inside another query. It can return:

- A single value  
- A single row  
- An entire table  

Subqueries are typically used to:

- Filter data  
- Calculate aggregates  
- Compare results from different queries  

---

### üß≠ Common Places You'll Use Subqueries:

- `WHERE` clauses  
- `FROM` clauses  
- `SELECT` clauses  

---

## üóÇÔ∏è Key Types of Subqueries

- **Scalar Subquery**: Returns a single value  
- **Row Subquery**: Returns a single row with multiple columns  
- **Table Subquery**: Returns multiple rows and columns  

---

## Basic Syntax

```sql
SELECT column1, column2
FROM table1
WHERE column1 IN (
    SELECT column1
    FROM table2
    WHERE condition
);


---

```sql
SELECT sub.column1, sub.column2
FROM (
    SELECT column1, column2
    FROM table1
    WHERE condition
) AS sub;


### üë®‚Äçüíª Let‚Äôs dive into some examples to demonstrate each type!

## üîå Connecting to the MySQL Database

Before we begin writing subqueries, let's connect our Jupyter Notebook to the MySQL database using the `%sql` magic command.

> üì¶ Make sure you've installed the following packages:
>
> - `ipython-sql`  
> - `pymysql`

In [1]:
# Load SQL extension for Jupyter
%load_ext sql

In [2]:
# Connect to the database
# Replace 'password' with your actual MySQL password
%sql mysql+pymysql://root:data@localhost:3306/company_db

'Connected: root@company_db'

### üßÆ 1. Scalar Subquery Example

**Question**: Find the employees whose salary is greater than the **average salary of all employees**.

A **scalar subquery** returns a single value ‚Äî in this case, the average salary.

In [4]:
%%sql
select  ROUND(AVG(salary)) AS average_salary 
from employees;

 * mysql+pymysql://root:***@localhost:3306/company_db
1 rows affected.

[(Decimal('61060'),)]

In [7]:
%%sql
SELECT emp_name, salary
FROM employees
WHERE salary > (
    SELECT AVG(salary)
    FROM employees
);

 * mysql+pymysql://root:***@localhost:3306/company_db
16 rows affected.

[('David', Decimal('70000.00')),
 ('Eve', Decimal('65000.00')),
 ('David', Decimal('61246.00')),
 ('Bobby', Decimal('68084.00')),
 ('Patricia', Decimal('76841.00')),
 ('Glenn', Decimal('75920.00')),
 ('Matthew', Decimal('74279.00')),
 ('Brianna', Decimal('70610.00')),
 ('Adam', Decimal('79374.00')),
 ('David', Decimal('79026.00')),
 ('Ricky', Decimal('64737.00')),
 ('Danielle', Decimal('78212.00')),
 ('Anthony', Decimal('67592.00')),
 ('Kathy', Decimal('73169.00')),
 ('Ronald', Decimal('74014.00')),
 ('Robert', Decimal('61250.00'))]

In [6]:
%%sql
SELECT emp_name, salary 
FROM employees WHERE salary > 61060;

 * mysql+pymysql://root:***@localhost:3306/company_db
16 rows affected.

[('David', Decimal('70000.00')),
 ('Eve', Decimal('65000.00')),
 ('David', Decimal('61246.00')),
 ('Bobby', Decimal('68084.00')),
 ('Patricia', Decimal('76841.00')),
 ('Glenn', Decimal('75920.00')),
 ('Matthew', Decimal('74279.00')),
 ('Brianna', Decimal('70610.00')),
 ('Adam', Decimal('79374.00')),
 ('David', Decimal('79026.00')),
 ('Ricky', Decimal('64737.00')),
 ('Danielle', Decimal('78212.00')),
 ('Anthony', Decimal('67592.00')),
 ('Kathy', Decimal('73169.00')),
 ('Ronald', Decimal('74014.00')),
 ('Robert', Decimal('61250.00'))]

 * mysql+pymysql://root:***@localhost:3306/company_db
10 rows affected.

[('Alice', 1),
 ('Charlie', 1),
 ('Felicia', 1),
 ('Elizabeth', 1),
 ('Matthew', 1),
 ('Margaret', 1),
 ('Michelle', 1),
 ('John', 1),
 ('Ricky', 1),
 ('Ronald', 1)]

### üßæ 2. Table Subquery Example

**Question**: List all employees who work in the same department as **'Alice'**.

A **table subquery** returns multiple rows and columns and is often used in the `FROM` clause or as part of `IN` conditions.

In [10]:
%%sql
SELECT emp_name, dept_id
FROM employees
WHERE dept_id = (
    SELECT dept_id
    FROM employees
    WHERE emp_name = 'Alice'
    LIMIT 1
);

 * mysql+pymysql://root:***@localhost:3306/company_db
10 rows affected.

[('Alice', 1),
 ('Charlie', 1),
 ('Felicia', 1),
 ('Elizabeth', 1),
 ('Matthew', 1),
 ('Margaret', 1),
 ('Michelle', 1),
 ('John', 1),
 ('Ricky', 1),
 ('Ronald', 1)]

### üîÅ 3. Correlated Subquery Example

**Question**: Find the employees who earn more than the **average salary in their department**.

A **correlated subquery** refers to columns from the outer query and is evaluated **once per row**.

In [12]:
%%sql
SELECT emp_name, salary, dept_id
FROM employees e
WHERE salary > (
    SELECT AVG(salary)
    FROM employees
    WHERE dept_id = e.dept_id
);

 * mysql+pymysql://root:***@localhost:3306/company_db
13 rows affected.

[('David', Decimal('70000.00'), 2),
 ('Bobby', Decimal('68084.00'), 2),
 ('Patricia', Decimal('76841.00'), 2),
 ('Glenn', Decimal('75920.00'), 4),
 ('Matthew', Decimal('74279.00'), 1),
 ('Brianna', Decimal('70610.00'), 2),
 ('Adam', Decimal('79374.00'), 3),
 ('David', Decimal('79026.00'), 3),
 ('Ricky', Decimal('64737.00'), 1),
 ('Danielle', Decimal('78212.00'), 4),
 ('Anthony', Decimal('67592.00'), 2),
 ('Kathy', Decimal('73169.00'), 4),
 ('Ronald', Decimal('74014.00'), 1)]

## Subquery 4 ‚Äî Employees earning more than the second-highest salary
We find the second-highest salary using `DISTINCT` and `LIMIT` inside a subquery, then compare salaries.

In [23]:
%%sql
SELECT DISTINCT salary
    FROM employees
ORDER BY salary DESC
    LIMIT 1 OFFSET 1

 * mysql+pymysql://root:***@localhost:3306/company_db
1 rows affected.

[(Decimal('79026.00'),)]

In [24]:
%%sql 
SELECT emp_name, salary
FROM employees
WHERE salary > (
    SELECT DISTINCT salary
    FROM employees
    ORDER BY salary DESC
    LIMIT 1 OFFSET 1
);

 * mysql+pymysql://root:***@localhost:3306/company_db
1 rows affected.

[('Adam', Decimal('79374.00'))]

## Subquery 5 ‚Äî Departments with more than 3 employees
We use a subquery to group employees by department and filter by count > 3.

In [25]:
%%sql
SELECT dept_name
FROM departments
WHERE dept_id IN (
    SELECT dept_id
    FROM employees
    GROUP BY dept_id
    HAVING COUNT(*) > 3
);

 * mysql+pymysql://root:***@localhost:3306/company_db
4 rows affected.

[('Sales',), ('Engineering',), ('HR',), ('Marketing',)]

In [26]:
%%sql
select dept_name from departments where dept_id IN (
    select dept_id from employees group by dept_id  having count(*)>3
);

 * mysql+pymysql://root:***@localhost:3306/company_db
4 rows affected.

[('Sales',), ('Engineering',), ('HR',), ('Marketing',)]

## Subquery 6 ‚Äî Employees in departments with at least one salary above $70,000
We find departments that have an employee with a salary > 70k, then select all employees in those departments.

In [29]:
%%sql
SELECT emp_name, dept_id, salary
FROM employees
WHERE dept_id IN (
    SELECT DISTINCT dept_id
    FROM employees
    WHERE salary > 70000 
);

 * mysql+pymysql://root:***@localhost:3306/company_db
30 rows affected.

[('Alice', 1, Decimal('50000.00')),
 ('Bob', 2, Decimal('60000.00')),
 ('Charlie', 1, Decimal('55000.00')),
 ('David', 2, Decimal('70000.00')),
 ('Eve', 3, Decimal('65000.00')),
 ('Frank', 4, Decimal('48000.00')),
 ('David', 4, Decimal('61246.00')),
 ('Brandi', 4, Decimal('40910.00')),
 ('Rebecca', 2, Decimal('41408.00')),
 ('Felicia', 1, Decimal('43663.00')),
 ('Elizabeth', 1, Decimal('50861.00')),
 ('Bobby', 2, Decimal('68084.00')),
 ('Patricia', 2, Decimal('76841.00')),
 ('Ronald', 2, Decimal('44232.00')),
 ('John', 3, Decimal('59499.00')),
 ('Glenn', 4, Decimal('75920.00')),
 ('Matthew', 1, Decimal('74279.00')),
 ('Brianna', 2, Decimal('70610.00')),
 ('Lynn', 2, Decimal('48060.00')),
 ('Margaret', 1, Decimal('46595.00')),
 ('Adam', 3, Decimal('79374.00')),
 ('Michelle', 1, Decimal('48851.00')),
 ('John', 1, Decimal('55374.00')),
 ('David', 3, Decimal('79026.00')),
 ('Ricky', 1, Decimal('64737.00')),
 ('Danielle', 4, Decimal('78212.00')),
 ('Anthony', 2, Decimal('67592.00')),
 ('Kathy', 4, Decimal('73169.00')),
 ('Ronald', 1, Decimal('74014.00')),
 ('Robert', 4, Decimal('61250.00'))]

In [ ]:
## Subquery 7 ‚Äî Employees earning less than the highest salary in Engineering
We first find the maximum salary in the Engineering department, then filter employees.

In [30]:
%%sql
SELECT emp_name, salary
FROM employees
WHERE salary < (
    SELECT MAX(salary)
    FROM employees e
    JOIN departments d ON e.dept_id = d.dept_id
    WHERE d.dept_name = 'Engineering'
);

 * mysql+pymysql://root:***@localhost:3306/company_db
26 rows affected.

[('Alice', Decimal('50000.00')),
 ('Bob', Decimal('60000.00')),
 ('Charlie', Decimal('55000.00')),
 ('David', Decimal('70000.00')),
 ('Eve', Decimal('65000.00')),
 ('Frank', Decimal('48000.00')),
 ('David', Decimal('61246.00')),
 ('Brandi', Decimal('40910.00')),
 ('Rebecca', Decimal('41408.00')),
 ('Felicia', Decimal('43663.00')),
 ('Elizabeth', Decimal('50861.00')),
 ('Bobby', Decimal('68084.00')),
 ('Ronald', Decimal('44232.00')),
 ('John', Decimal('59499.00')),
 ('Glenn', Decimal('75920.00')),
 ('Matthew', Decimal('74279.00')),
 ('Brianna', Decimal('70610.00')),
 ('Lynn', Decimal('48060.00')),
 ('Margaret', Decimal('46595.00')),
 ('Michelle', Decimal('48851.00')),
 ('John', Decimal('55374.00')),
 ('Ricky', Decimal('64737.00')),
 ('Anthony', Decimal('67592.00')),
 ('Kathy', Decimal('73169.00')),
 ('Ronald', Decimal('74014.00')),
 ('Robert', Decimal('61250.00'))]

## Subquery 8 ‚Äî Marketing employees earning above department average
We combine filtering by department ('Marketing') with a correlated subquery for average salary comparison.

In [31]:
%%sql
SELECT emp_name, salary
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
WHERE d.dept_name = 'Marketing'
  AND salary > (
      SELECT AVG(salary)
      FROM employees
      WHERE dept_id = e.dept_id
  );

 * mysql+pymysql://root:***@localhost:3306/company_db
3 rows affected.

[('Glenn', Decimal('75920.00')),
 ('Danielle', Decimal('78212.00')),
 ('Kathy', Decimal('73169.00'))]

## üß± CTEs (Common Table Expressions) Overview

A **CTE (Common Table Expression)** is a **temporary result set** that you can reference within a `SELECT`, `INSERT`, `UPDATE`, or `DELETE` query.

CTEs are defined using the `WITH` keyword and are similar to subqueries ‚Äî but more **readable** and **reusable**.

They‚Äôre especially helpful when you want to:

- Break a complex query into multiple logical steps  
- Avoid repeating the same subquery multiple times  
- Improve query structure and readability


**Basic Syntax**

````sql
WITH cte_name AS (
    -- your query goes here
    SELECT column1, column2
    FROM table_name
    WHERE condition
)
SELECT column1, column2
FROM cte_name;

### üß± 1. Simple CTE Example

**Question**: Find the **average salary per department**, and then list the employees who earn **more than the average** in their department.

We‚Äôll use a **CTE** to calculate the average salary per department, then reference it in the main query.

In [ ]:
## CTE 1 ‚Äî Employees earning more than their department average
We create a CTE to calculate the average salary per department, then join it back to filter employees whose salary is higher.

In [13]:
%%sql
SELECT dept_id, AVG(salary) AS avg_salary
    FROM employees
    GROUP BY dept_id

 * mysql+pymysql://root:***@localhost:3306/company_db
4 rows affected.

[(1, Decimal('56337.400000')),
 (2, Decimal('60758.555556')),
 (3, Decimal('70724.750000')),
 (4, Decimal('62672.428571'))]

In [18]:
%%sql
WITH dept_avg AS (
    SELECT dept_id, AVG(salary) AS avg_salary
    FROM employees
    GROUP BY dept_id
)
SELECT e.emp_name, e.salary, d.dept_name, dept_avg.avg_salary
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
JOIN dept_avg ON e.dept_id = dept_avg.dept_id
WHERE e.salary > dept_avg.avg_salary;

 * mysql+pymysql://root:***@localhost:3306/company_db
13 rows affected.

[('Matthew', Decimal('74279.00'), 'Sales', Decimal('56337.400000')),
 ('Ricky', Decimal('64737.00'), 'Sales', Decimal('56337.400000')),
 ('Ronald', Decimal('74014.00'), 'Sales', Decimal('56337.400000')),
 ('David', Decimal('70000.00'), 'Engineering', Decimal('60758.555556')),
 ('Bobby', Decimal('68084.00'), 'Engineering', Decimal('60758.555556')),
 ('Patricia', Decimal('76841.00'), 'Engineering', Decimal('60758.555556')),
 ('Brianna', Decimal('70610.00'), 'Engineering', Decimal('60758.555556')),
 ('Anthony', Decimal('67592.00'), 'Engineering', Decimal('60758.555556')),
 ('Adam', Decimal('79374.00'), 'HR', Decimal('70724.750000')),
 ('David', Decimal('79026.00'), 'HR', Decimal('70724.750000')),
 ('Glenn', Decimal('75920.00'), 'Marketing', Decimal('62672.428571')),
 ('Danielle', Decimal('78212.00'), 'Marketing', Decimal('62672.428571')),
 ('Kathy', Decimal('73169.00'), 'Marketing', Decimal('62672.428571'))]

## CTE 2 ‚Äî Recursive hierarchy starting from the highest-paid employee
Our sample schema doesn‚Äôt have a manager column, but this example shows the pattern for recursive CTEs.

In [41]:
%%sql
SELECT emp_id, emp_name, salary, dept_id, NULL AS manager_id
    FROM employees
    WHERE salary = (SELECT MAX(salary) FROM employees)

 * mysql+pymysql://root:***@localhost:3306/company_db
1 rows affected.

[(21, 'Adam', Decimal('79374.00'), 3, None)]

## CTE 3 ‚Äî Highest-paid employee per department with department average
We calculate max salary per department and join with averages in the same query.

In [46]:
%%sql
WITH dept_stats AS (
    SELECT dept_id, AVG(salary) AS avg_salary, MAX(salary) AS max_salary
    FROM employees
    GROUP BY dept_id
)
SELECT e.emp_name, e.salary, d.dept_name, ds.avg_salary
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
JOIN dept_stats ds ON e.dept_id = ds.dept_id
WHERE e.salary = ds.max_salary;

 * mysql+pymysql://root:***@localhost:3306/company_db
4 rows affected.

[('Matthew', Decimal('74279.00'), 'Sales', Decimal('56337.400000')),
 ('Patricia', Decimal('76841.00'), 'Engineering', Decimal('60758.555556')),
 ('Adam', Decimal('79374.00'), 'HR', Decimal('70724.750000')),
 ('Danielle', Decimal('78212.00'), 'Marketing', Decimal('62672.428571'))]

## CTE 4 ‚Äî Departments with total salary over $500,000
We sum salaries per department and filter in the outer query.

In [47]:
%%sql
WITH dept_total AS (
    SELECT dept_id, SUM(salary) AS total_salary
    FROM employees
    GROUP BY dept_id
)
SELECT d.dept_name, total_salary
FROM dept_total dt
JOIN departments d ON dt.dept_id = d.dept_id
WHERE total_salary > 500000;

 * mysql+pymysql://root:***@localhost:3306/company_db
2 rows affected.

[('Sales', Decimal('563374.00')), ('Engineering', Decimal('546827.00'))]

In [ ]:
## CTE 5 ‚Äî Departments with more than 5 employees
We count employees per department in a CTE, then filter.

In [48]:
%%sql
WITH dept_count AS (
    SELECT dept_id, COUNT(*) AS emp_count
    FROM employees
    GROUP BY dept_id
)
SELECT d.dept_name, emp_count
FROM dept_count dc
JOIN departments d ON dc.dept_id = d.dept_id
WHERE emp_count > 5;

 * mysql+pymysql://root:***@localhost:3306/company_db
3 rows affected.

[('Sales', 10), ('Engineering', 9), ('Marketing', 7)]

In [ ]:
## CTE 6 ‚Äî Employees earning over $80,000 and with more than 5 years of service
Our schema lacks a hire date column, so here‚Äôs the pattern if such a column existed.

In [50]:
%%sql
    SELECT emp_id, emp_name, salary
    FROM employees
    WHERE salary > 80000

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

In [51]:
%%sql
WITH high_earners AS (
    SELECT emp_id, emp_name, salary
    FROM employees
    WHERE salary > 80000
)
SELECT *
FROM high_earners

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

## CTE 7 ‚Äî Difference between employee salary and department average
We calculate department averages, then compute the difference for each employee.

In [53]:
%%sql
 SELECT dept_id, AVG(salary) AS avg_salary
    FROM employees
    GROUP BY dept_id;

 * mysql+pymysql://root:***@localhost:3306/company_db
4 rows affected.

[(1, Decimal('56337.400000')),
 (2, Decimal('60758.555556')),
 (3, Decimal('70724.750000')),
 (4, Decimal('62672.428571'))]

In [52]:
%%sql
WITH dept_avg AS (
    SELECT dept_id, AVG(salary) AS avg_salary
    FROM employees
    GROUP BY dept_id
)
SELECT e.emp_name, e.salary, d.dept_name, 
       e.salary - da.avg_salary AS salary_diff
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
JOIN dept_avg da ON e.dept_id = da.dept_id;

 * mysql+pymysql://root:***@localhost:3306/company_db
30 rows affected.

[('Alice', Decimal('50000.00'), 'Sales', Decimal('-6337.400000')),
 ('Charlie', Decimal('55000.00'), 'Sales', Decimal('-1337.400000')),
 ('Felicia', Decimal('43663.00'), 'Sales', Decimal('-12674.400000')),
 ('Elizabeth', Decimal('50861.00'), 'Sales', Decimal('-5476.400000')),
 ('Matthew', Decimal('74279.00'), 'Sales', Decimal('17941.600000')),
 ('Margaret', Decimal('46595.00'), 'Sales', Decimal('-9742.400000')),
 ('Michelle', Decimal('48851.00'), 'Sales', Decimal('-7486.400000')),
 ('John', Decimal('55374.00'), 'Sales', Decimal('-963.400000')),
 ('Ricky', Decimal('64737.00'), 'Sales', Decimal('8399.600000')),
 ('Ronald', Decimal('74014.00'), 'Sales', Decimal('17676.600000')),
 ('Bob', Decimal('60000.00'), 'Engineering', Decimal('-758.555556')),
 ('David', Decimal('70000.00'), 'Engineering', Decimal('9241.444444')),
 ('Rebecca', Decimal('41408.00'), 'Engineering', Decimal('-19350.555556')),
 ('Bobby', Decimal('68084.00'), 'Engineering', Decimal('7325.444444')),
 ('Patricia', Decimal('76841.00'), 'Engineering', Decimal('16082.444444')),
 ('Ronald', Decimal('44232.00'), 'Engineering', Decimal('-16526.555556')),
 ('Brianna', Decimal('70610.00'), 'Engineering', Decimal('9851.444444')),
 ('Lynn', Decimal('48060.00'), 'Engineering', Decimal('-12698.555556')),
 ('Anthony', Decimal('67592.00'), 'Engineering', Decimal('6833.444444')),
 ('Eve', Decimal('65000.00'), 'HR', Decimal('-5724.750000')),
 ('John', Decimal('59499.00'), 'HR', Decimal('-11225.750000')),
 ('Adam', Decimal('79374.00'), 'HR', Decimal('8649.250000')),
 ('David', Decimal('79026.00'), 'HR', Decimal('8301.250000')),
 ('Frank', Decimal('48000.00'), 'Marketing', Decimal('-14672.428571')),
 ('David', Decimal('61246.00'), 'Marketing', Decimal('-1426.428571')),
 ('Brandi', Decimal('40910.00'), 'Marketing', Decimal('-21762.428571')),
 ('Glenn', Decimal('75920.00'), 'Marketing', Decimal('13247.571429')),
 ('Danielle', Decimal('78212.00'), 'Marketing', Decimal('15539.571429')),
 ('Kathy', Decimal('73169.00'), 'Marketing', Decimal('10496.571429')),
 ('Robert', Decimal('61250.00'), 'Marketing', Decimal('-1422.428571'))]

## CTE 8 ‚Äî Top 3 highest-paid employees per department
We use `ROW_NUMBER()` to rank employees by salary within each department, then filter for top 3.

In [54]:
%%sql
WITH ranked AS (
    SELECT e.emp_name, e.salary, e.dept_id,
           ROW_NUMBER() OVER (PARTITION BY dept_id ORDER BY salary DESC) AS rn
    FROM employees e
)
SELECT r.emp_name, r.salary, d.dept_name
FROM ranked r
JOIN departments d ON r.dept_id = d.dept_id
WHERE rn <= 3;

 * mysql+pymysql://root:***@localhost:3306/company_db
12 rows affected.

[('Matthew', Decimal('74279.00'), 'Sales'),
 ('Ronald', Decimal('74014.00'), 'Sales'),
 ('Ricky', Decimal('64737.00'), 'Sales'),
 ('Patricia', Decimal('76841.00'), 'Engineering'),
 ('Brianna', Decimal('70610.00'), 'Engineering'),
 ('David', Decimal('70000.00'), 'Engineering'),
 ('Adam', Decimal('79374.00'), 'HR'),
 ('David', Decimal('79026.00'), 'HR'),
 ('Eve', Decimal('65000.00'), 'HR'),
 ('Danielle', Decimal('78212.00'), 'Marketing'),
 ('Glenn', Decimal('75920.00'), 'Marketing'),
 ('Kathy', Decimal('73169.00'), 'Marketing')]

## ü™ü Views Overview

A **view** in SQL is essentially a **saved query** that you can treat like a table.  
It allows you to create a **virtual table** from one or more tables, and you can use it in your queries just like a regular table.

Views are especially useful for:

- Simplifying complex queries  
- Enhancing security  
- Abstracting logic from end users  

---

### ‚≠ê Key Benefits of Views

- **Simplicity**: Simplifies complex queries by storing common query logic.
- **Security**: Restricts access to specific columns or rows in a table.
- **Reusability**: Once created, a view can be reused in multiple queries.


### Basic Syntax to Create a View:

````sql
CREATE VIEW view_name AS
SELECT column1, column2, ...
FROM table_name
WHERE condition;

### ü™ü 1. Basic View Example

**Question**: Create a view that shows the **employee names**, their **salaries**, and their **department names**.


## View 1 ‚Äî Employees with salary and department names
We join the `employees` and `departments` tables to create a view showing each employee‚Äôs name, salary, and department.

In [55]:
%%sql
CREATE OR REPLACE VIEW v_employee_details AS
SELECT e.emp_name, e.salary, d.dept_name
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id;

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

### ü™ü 2. View with Aggregation

**Question**: Create a view to show the total salary expenses by department.

In [56]:
%%sql
CREATE OR REPLACE VIEW v_department_salary_total AS
SELECT d.dept_name, SUM(e.salary) AS total_salary
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
GROUP BY d.dept_name;

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

In [57]:
%%sql
SELECT * FROM v_department_salary_total;

 * mysql+pymysql://root:***@localhost:3306/company_db
4 rows affected.

[('Sales', Decimal('563374.00')),
 ('Engineering', Decimal('546827.00')),
 ('HR', Decimal('282899.00')),
 ('Marketing', Decimal('438707.00'))]

### üõ°Ô∏è 3. Using Views for Security

**Question**: Create a view that excludes salary information for HR department employees, for restricted access.

In [59]:
%%sql
CREATE OR REPLACE VIEW v_engineering_high_salary AS
SELECT e.emp_name, e.salary
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
WHERE d.dept_name = 'Engineering'
  AND e.salary > 60000;

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

In [60]:
%%sql
select * from v_engineering_high_salary;

 * mysql+pymysql://root:***@localhost:3306/company_db
5 rows affected.

[('David', Decimal('70000.00')),
 ('Bobby', Decimal('68084.00')),
 ('Patricia', Decimal('76841.00')),
 ('Brianna', Decimal('70610.00')),
 ('Anthony', Decimal('67592.00'))]

Creating a View to Exclude Salary for HR Department üîí
Here's the view to restrict access to salary information for HR department employees:

In [61]:
%%sql
CREATE OR REPLACE VIEW v_employee_public_data AS
SELECT
    e.emp_id,
    e.emp_name,
    e.dept_id,
    CASE
        WHEN d.dept_name = 'Human Resources' THEN NULL
        ELSE e.salary
    END AS salary,
    d.dept_name
FROM
    employees e
JOIN
    departments d ON e.dept_id = d.dept_id;

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

In [62]:
%%sql
select * from v_employee_public_data;

 * mysql+pymysql://root:***@localhost:3306/company_db
30 rows affected.

[(1, 'Alice', 1, Decimal('50000.00'), 'Sales'),
 (3, 'Charlie', 1, Decimal('55000.00'), 'Sales'),
 (10, 'Felicia', 1, Decimal('43663.00'), 'Sales'),
 (11, 'Elizabeth', 1, Decimal('50861.00'), 'Sales'),
 (17, 'Matthew', 1, Decimal('74279.00'), 'Sales'),
 (20, 'Margaret', 1, Decimal('46595.00'), 'Sales'),
 (22, 'Michelle', 1, Decimal('48851.00'), 'Sales'),
 (23, 'John', 1, Decimal('55374.00'), 'Sales'),
 (25, 'Ricky', 1, Decimal('64737.00'), 'Sales'),
 (29, 'Ronald', 1, Decimal('74014.00'), 'Sales'),
 (2, 'Bob', 2, Decimal('60000.00'), 'Engineering'),
 (4, 'David', 2, Decimal('70000.00'), 'Engineering'),
 (9, 'Rebecca', 2, Decimal('41408.00'), 'Engineering'),
 (12, 'Bobby', 2, Decimal('68084.00'), 'Engineering'),
 (13, 'Patricia', 2, Decimal('76841.00'), 'Engineering'),
 (14, 'Ronald', 2, Decimal('44232.00'), 'Engineering'),
 (18, 'Brianna', 2, Decimal('70610.00'), 'Engineering'),
 (19, 'Lynn', 2, Decimal('48060.00'), 'Engineering'),
 (27, 'Anthony', 2, Decimal('67592.00'), 'Engineering'),
 (5, 'Eve', 3, Decimal('65000.00'), 'HR'),
 (15, 'John', 3, Decimal('59499.00'), 'HR'),
 (21, 'Adam', 3, Decimal('79374.00'), 'HR'),
 (24, 'David', 3, Decimal('79026.00'), 'HR'),
 (6, 'Frank', 4, Decimal('48000.00'), 'Marketing'),
 (7, 'David', 4, Decimal('61246.00'), 'Marketing'),
 (8, 'Brandi', 4, Decimal('40910.00'), 'Marketing'),
 (16, 'Glenn', 4, Decimal('75920.00'), 'Marketing'),
 (26, 'Danielle', 4, Decimal('78212.00'), 'Marketing'),
 (28, 'Kathy', 4, Decimal('73169.00'), 'Marketing'),
 (30, 'Robert', 4, Decimal('61250.00'), 'Marketing')]

### üìã Comparison: Subqueries vs. CTEs vs. Views

| **Features**     | **Subqueries**                                                                                                            | **CTEs**                                                                                                                                                                    | **Views**                                                                                                                                                                           |
| ----------------- | ------------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |
| **Definition**    | A query nested inside another query.                                                                                      | A temporary result set defined within a query using the `WITH` keyword.                                                                                                     | A saved query that can be treated like a table.                                                                                                                                     |
| **Syntax**        | Nested inside `SELECT`, `INSERT`, `UPDATE`, `DELETE`.                                                                     | Defined using `WITH` keyword before the main query.                                                                                                                         | Defined with `CREATE VIEW` to save the query as a virtual table.                                                                                                                    |
| **Readability**   | Can be harder to read, especially if deeply nested.                                                                       | Easier to read and understand; breaks complex queries into steps.                                                                                                           | Simplifies recurring complex queries for reuse.                                                                                                                                     |
| **Performance**   | May be less efficient for repeated queries; evaluated for each row in some cases.                                         | Often more efficient for complex queries as they are evaluated once per query execution.                                                                                    | Depending on the DBMS, may be cached, improving performance for repeated queries.                                                                                                   |
| **Use Case**      | - Filtering data (e.g., comparison between rows). <br> - Simple aggregations or comparisons.                              | - Breaking down complex queries into readable chunks. <br> - Recursive queries. <br> - Reusable logic within a query.                                                       | - Simplifying complex queries for reuse. <br> - Restricting access to specific columns or rows. <br> - Sharing commonly used data across multiple queries.                          |
| **When to Use**   | - When you need a quick, temporary result in a query.<br> - For comparing values between rows (e.g., `IN`, `ANY`, `ALL`). | - When breaking down complex queries into logical steps.<br> - When needing to recursively process hierarchical data.<br> - When querying the same subquery multiple times. | - When you need to simplify and reuse complex queries.<br> - For creating a consistent data access layer across applications.<br> - When restricting or abstracting sensitive data. |
| **Updatability**  | Subqueries cannot usually be updated directly.                                                                            | CTEs are generally not updatable (unless simple and direct).                                                                                                                | Views may or may not be updatable, depending on their complexity (e.g., if they involve aggregation, joins, etc.).                                                                  |
| **Persistence**   | Temporary; exists only within the query execution.                                                                        | Temporary; only exists during query execution.                                                                                                                              | Persistent; remains in the database until explicitly dropped.                                                                                                                       |
| **Flexibility**   | Less flexible; cannot reference the same subquery multiple times in a single query.                                       | More flexible; can reference multiple CTEs within a query.                                                                                                                  | Very flexible; can be used in any query and treated like a table.                                                                                                                   |
| **Example Query** | `SELECT emp_name FROM employees WHERE dept_id = (SELECT dept_id FROM departments WHERE dept_name = 'Engineering')`        | `WITH DeptAvg AS (SELECT dept_id, AVG(salary) AS avg_salary FROM employees GROUP BY dept_id) SELECT * FROM DeptAvg`                                                         | `CREATE VIEW EmployeeSalaryView AS SELECT emp_name, salary FROM employees WHERE salary > 60000`                                                                                     |

In [ ]:
View 4 ‚Äî Employees with more than 5 years of service (excluding salary)
Our schema lacks a hire date, so we include the pattern assuming `hire_date` exists.

In [76]:
%%sql
CREATE OR REPLACE VIEW v_long_service_employees AS
SELECT e.emp_name, d.dept_name
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
-- WHERE TIMESTAMPDIFF(YEAR, e.hire_date, CURDATE()) > 5
;

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

In [77]:
%%sql
select * from v_long_service_employees;

 * mysql+pymysql://root:***@localhost:3306/company_db
30 rows affected.

[('Alice', 'Sales'),
 ('Charlie', 'Sales'),
 ('Felicia', 'Sales'),
 ('Elizabeth', 'Sales'),
 ('Matthew', 'Sales'),
 ('Margaret', 'Sales'),
 ('Michelle', 'Sales'),
 ('John', 'Sales'),
 ('Ricky', 'Sales'),
 ('Ronald', 'Sales'),
 ('Bob', 'Engineering'),
 ('David', 'Engineering'),
 ('Rebecca', 'Engineering'),
 ('Bobby', 'Engineering'),
 ('Patricia', 'Engineering'),
 ('Ronald', 'Engineering'),
 ('Brianna', 'Engineering'),
 ('Lynn', 'Engineering'),
 ('Anthony', 'Engineering'),
 ('Eve', 'HR'),
 ('John', 'HR'),
 ('Adam', 'HR'),
 ('David', 'HR'),
 ('Frank', 'Marketing'),
 ('David', 'Marketing'),
 ('Brandi', 'Marketing'),
 ('Glenn', 'Marketing'),
 ('Danielle', 'Marketing'),
 ('Kathy', 'Marketing'),
 ('Robert', 'Marketing')]

In [ ]:
## View 5 ‚Äî Average salary per department
We calculate average salaries grouped by department.

In [74]:
%%sql
CREATE OR REPLACE VIEW v_department_avg_salary AS
SELECT d.dept_name, AVG(e.salary) AS avg_salary
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
GROUP BY d.dept_name;

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

In [75]:
%%sql
select * from v_department_avg_salary;

 * mysql+pymysql://root:***@localhost:3306/company_db
4 rows affected.

[('Sales', Decimal('56337.400000')),
 ('Engineering', Decimal('60758.555556')),
 ('HR', Decimal('70724.750000')),
 ('Marketing', Decimal('62672.428571'))]

In [ ]:
## View 6 ‚Äî Summary of employees in each department
We show employee count and total salary for each department.

In [72]:
%%sql
CREATE OR REPLACE VIEW v_department_summary AS
SELECT d.dept_name, COUNT(e.emp_id) AS employee_count, SUM(e.salary) AS total_salary
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
GROUP BY d.dept_name;

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

In [73]:
%%sql
select * from v_department_summary;

 * mysql+pymysql://root:***@localhost:3306/company_db
4 rows affected.

[('Sales', 10, Decimal('563374.00')),
 ('Engineering', 9, Decimal('546827.00')),
 ('HR', 4, Decimal('282899.00')),
 ('Marketing', 7, Decimal('438707.00'))]

In [ ]:
## View 7 ‚Äî Sales employees with salary above $50,000
Simple join and filtering by department and salary.

In [70]:
%%sql
CREATE OR REPLACE VIEW v_sales_high_salary AS
SELECT e.emp_name, e.salary
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
WHERE d.dept_name = 'Sales'
  AND e.salary > 50000;

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

In [71]:
%%sql
select * from v_sales_high_salary;

 * mysql+pymysql://root:***@localhost:3306/company_db
6 rows affected.

[('Charlie', Decimal('55000.00')),
 ('Elizabeth', Decimal('50861.00')),
 ('Matthew', Decimal('74279.00')),
 ('John', Decimal('55374.00')),
 ('Ricky', Decimal('64737.00')),
 ('Ronald', Decimal('74014.00'))]

In [ ]:
## View 8 ‚Äî Employees making the highest salary in each department
We use a correlated subquery to match each department‚Äôs maximum salary.

In [68]:
%%sql
CREATE OR REPLACE VIEW v_department_top_earners AS
SELECT e.emp_name, e.salary, d.dept_name
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
WHERE e.salary = (
    SELECT MAX(salary)
    FROM employees
    WHERE dept_id = e.dept_id
);

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

In [69]:
%%sql
select * from v_department_top_earners;

 * mysql+pymysql://root:***@localhost:3306/company_db
4 rows affected.

[('Matthew', Decimal('74279.00'), 'Sales'),
 ('Patricia', Decimal('76841.00'), 'Engineering'),
 ('Adam', Decimal('79374.00'), 'HR'),
 ('Danielle', Decimal('78212.00'), 'Marketing')]

In [ ]:
## View 9 ‚Äî Employees earning above the company average
We compute the company-wide average in a subquery and join departments for names.

In [65]:
%%sql
CREATE OR REPLACE VIEW v_above_company_avg AS
SELECT e.emp_name, e.salary, d.dept_name
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id
WHERE e.salary > (
    SELECT AVG(salary) FROM employees
);

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

In [67]:
%%sql
select * from v_above_company_avg;

 * mysql+pymysql://root:***@localhost:3306/company_db
16 rows affected.

[('Matthew', Decimal('74279.00'), 'Sales'),
 ('Ricky', Decimal('64737.00'), 'Sales'),
 ('Ronald', Decimal('74014.00'), 'Sales'),
 ('David', Decimal('70000.00'), 'Engineering'),
 ('Bobby', Decimal('68084.00'), 'Engineering'),
 ('Patricia', Decimal('76841.00'), 'Engineering'),
 ('Brianna', Decimal('70610.00'), 'Engineering'),
 ('Anthony', Decimal('67592.00'), 'Engineering'),
 ('Eve', Decimal('65000.00'), 'HR'),
 ('Adam', Decimal('79374.00'), 'HR'),
 ('David', Decimal('79026.00'), 'HR'),
 ('David', Decimal('61246.00'), 'Marketing'),
 ('Glenn', Decimal('75920.00'), 'Marketing'),
 ('Danielle', Decimal('78212.00'), 'Marketing'),
 ('Kathy', Decimal('73169.00'), 'Marketing'),
 ('Robert', Decimal('61250.00'), 'Marketing')]

In [ ]:
## View 10 ‚Äî Salary difference from department average
We calculate the difference between each employee‚Äôs salary and the department‚Äôs average salary.

In [63]:
%%sql
CREATE OR REPLACE VIEW v_salary_diff_dept_avg AS
SELECT e.emp_name, e.salary, d.dept_name,
       e.salary - AVG(e.salary) OVER (PARTITION BY e.dept_id) AS salary_diff
FROM employees e
JOIN departments d ON e.dept_id = d.dept_id;

 * mysql+pymysql://root:***@localhost:3306/company_db
0 rows affected.

[]

In [64]:
%%sql 
select * from v_salary_diff_dept_avg;

 * mysql+pymysql://root:***@localhost:3306/company_db
30 rows affected.

[('Alice', Decimal('50000.00'), 'Sales', None),
 ('Charlie', Decimal('55000.00'), 'Sales', Decimal('-1337.400000')),
 ('Felicia', Decimal('43663.00'), 'Sales', Decimal('-12674.400000')),
 ('Elizabeth', Decimal('50861.00'), 'Sales', Decimal('-5476.400000')),
 ('Matthew', Decimal('74279.00'), 'Sales', Decimal('17941.600000')),
 ('Margaret', Decimal('46595.00'), 'Sales', Decimal('-9742.400000')),
 ('Michelle', Decimal('48851.00'), 'Sales', Decimal('-7486.400000')),
 ('John', Decimal('55374.00'), 'Sales', Decimal('-963.400000')),
 ('Ricky', Decimal('64737.00'), 'Sales', Decimal('8399.600000')),
 ('Ronald', Decimal('74014.00'), 'Sales', Decimal('17676.600000')),
 ('Bob', Decimal('60000.00'), 'Engineering', None),
 ('David', Decimal('70000.00'), 'Engineering', Decimal('9241.444444')),
 ('Rebecca', Decimal('41408.00'), 'Engineering', Decimal('-19350.555556')),
 ('Bobby', Decimal('68084.00'), 'Engineering', Decimal('7325.444444')),
 ('Patricia', Decimal('76841.00'), 'Engineering', Decimal('16082.444444')),
 ('Ronald', Decimal('44232.00'), 'Engineering', Decimal('-16526.555556')),
 ('Brianna', Decimal('70610.00'), 'Engineering', Decimal('9851.444444')),
 ('Lynn', Decimal('48060.00'), 'Engineering', Decimal('-12698.555556')),
 ('Anthony', Decimal('67592.00'), 'Engineering', Decimal('6833.444444')),
 ('Eve', Decimal('65000.00'), 'HR', None),
 ('John', Decimal('59499.00'), 'HR', Decimal('-11225.750000')),
 ('Adam', Decimal('79374.00'), 'HR', Decimal('8649.250000')),
 ('David', Decimal('79026.00'), 'HR', Decimal('8301.250000')),
 ('Frank', Decimal('48000.00'), 'Marketing', Decimal('-14672.428571')),
 ('David', Decimal('61246.00'), 'Marketing', Decimal('-1426.428571')),
 ('Brandi', Decimal('40910.00'), 'Marketing', Decimal('-21762.428571')),
 ('Glenn', Decimal('75920.00'), 'Marketing', Decimal('13247.571429')),
 ('Danielle', Decimal('78212.00'), 'Marketing', Decimal('15539.571429')),
 ('Kathy', Decimal('73169.00'), 'Marketing', Decimal('10496.571429')),
 ('Robert', Decimal('61250.00'), 'Marketing', Decimal('-1422.428571'))]

## üìù Summary of Key Points

- **Subqueries** are great for simple, inline filtering or aggregation, but they can become difficult to manage when **nested deeply**.  
  They're evaluated **for each row** when used in the `WHERE` or `SELECT` clause.

- **CTEs** are best for improving **readability** and **manageability** of complex queries.  
  They allow breaking down logic into digestible parts and are great for **recursive queries** or **reusable subqueries** within a single query.

- **Views** are useful for **abstracting** and **simplifying** complex queries.  
  They can also enhance **security** by limiting the data exposed.  
  Views are **persistent** and **reusable** across multiple queries.

## üß† Practice Exercises: Subqueries, CTEs, and Views

Use the `employees` and `departments` tables to write SQL queries that solve the following problems. Try to apply subqueries, CTEs, and views as appropriate.

---

### üîç Subqueries Practice Exercises

1. Find all employees whose salary is greater than the average salary of the entire company.
2. List the employees who earn more than the average salary in their department.
3. Find the employees who work in the same department as **'Bob'**.
4. Get the employees who have a higher salary than the second-highest salary in the company.
5. List all departments that have more than 3 employees.
6. Find employees who are in a department that has at least one employee earning more than **$70,000**.
7. List the employees who earn less than the highest salary in the **'Engineering'** department.
8. Get the names of employees who have a salary greater than the average salary of their department, but only for employees in the **'Marketing'** department.

---

### üß± CTEs Practice Exercises

1. Create a CTE that calculates the average salary per department and use it to list employees whose salary is higher than their department‚Äôs average.
2. Create a **recursive CTE** to find the manager-subordinate hierarchy starting with the highest-paid employee.
3. Using a CTE, find the employees who have the **highest salary** in their department, and show their names and the department's average salary.
4. Create a CTE that calculates the **total salary by department** and use it to find departments with a total salary expense greater than **500,000** Dollars.
5. Write a CTE that calculates the number of employees in each department and use it to list departments with more than **5 employees**.
6. Use a CTE to find employees who earn more than **$80,000** and have been with the company for more than **5 years**.
7. Write a CTE to find the average salary for each department and the **difference between each employee's salary and the department's average**.
8. Create a CTE that ranks employees by salary within their department and show the **top 3 highest-paid employees** from each department.

---

### ü™ü Views Practice Exercises

1. Create a view to display all employees' names, their salary, and their department names.
2. Create a view that shows the **total salary expenses** per department.
3. Create a view that shows only employees who earn more than **60,000** Dollars and are in the **'Engineering'** department.
4. Create a view to list employees who have been with the company for more than **5 years**, excluding the salary column.
5. Create a view to show the departments and the **average salary** for each department.
6. Create a view that provides a summary of the employees in each department, showing the **number of employees** and the **total salary** for each department.
7. Create a view to show only employees in the **'Sales'** department with salaries greater than **$50,000**.
8. Create a view to list the employees who are making the **highest salary** in their respective departments.
9. Create a view that shows the names of employees who earn more than the **average salary in the company** and display their department names.
10. Create a view that shows employees and their **salary differences from the department's average salary**.